In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd
from numpy.random import randn

In [5]:
#1. Create a Series with the following data:data=[5,10,15,20,25,30],index=['a','b','c','d','e','f']

ser1 = Series([5,10,15,20,25,30],index=['a', 'b', 'c', 'd', 'e','f'])
ser1

a     5
b    10
c    15
d    20
e    25
f    30
dtype: int64

In [6]:
#2. Sort the Series by index in ascending order
ser1.sort_index()

a     5
b    10
c    15
d    20
e    25
f    30
dtype: int64

In [7]:
#3. Sort the Series by values in descending order
ser1.sort_values()

a     5
b    10
c    15
d    20
e    25
f    30
dtype: int64

In [30]:
#4. Rank the Series and add a new column to the Series with the rank of each value
ser1.rank(ascending=True)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
dtype: float64

In [16]:
#5. Create a DataFrame with the following data: data = {'A': [1, 3, 2, 4, 5], 'B': [10, 20, 30, 40, 50], 'C':[100, 200, 300, 400, 500]}
df = pd.DataFrame({
    'A': [1,2,3,4,5],
    'B': [10,20,30,40,50],
    'C': [100,200,300,400,500]})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [19]:
#6. Sort the DataFrame by values in column 'A' in ascending order
df.sort_values(by='A', ascending=True)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [25]:
#7. Sort the DataFrame by values in column 'B' in descending order
df.sort_values(by=['B'], ascending=False)

   A   B    C
4  5  50  500
3  4  40  400
2  3  30  300
1  2  20  200
0  1  10  100

In [26]:
#8. Sort the DataFrame by values in column 'A' in ascending order and then by values in column 'B' in descending order.
df.sort_values(by=['A','B'], ascending=[True,False])

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [28]:
#9. Rank the DataFrame by values in column 'A' and add a new column to the DataFrame with the rank of each value.

   A   B    C  a_col
0  1  10  100    1.0
1  2  20  200    2.0
2  3  30  300    3.0
3  4  40  400    4.0
4  5  50  500    5.0

In [ ]:
#10. Sort the DataFrame by values in column 'A' and then by rank in ascending order.